Autodesk.Revit.DB.FabricationPartType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32)
Creates a fabrication part type element based on a specific fabrication servic button and condition.
document:
The document.
button:
The fabrication service button.
condition:
The condition index.
Returns:
The created fabrication part type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type already exists.
Since:
2016